cases/cfd/fluids/taylor_green_vortex_2d_re100/solution/case/0/p
/*--------------------------------*- C++ -*----------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}

// Kinematic pressure (incompressible). The domain is doubly periodic, so every
// side patch is cyclic; pressure is defined up to a constant and a single
// reference cell is pinned via fvSolution pRefCell/pRefValue.
dimensions [0 2 -2 0 0 0 0];

internalField uniform 0;

boundaryField
{
    left
    {
        type            cyclic;
    }
    right
    {
        type            cyclic;
    }
    bottom
    {
        type            cyclic;
    }
    top
    {
        type            cyclic;
    }
    frontAndBack
    {
        type            empty;
    }
}
