cases/cfd/fluids/taylor_green_vortex_2d_re100/solution/case/Allrun
#!/usr/bin/env bash
set -eo pipefail
cd "$(dirname "$0")"
if ! command -v blockMesh >/dev/null 2>&1; then
    set +u
    source /usr/lib/openfoam/openfoam2412/etc/bashrc
    set -u
fi
blockMesh
checkMesh
setExprFields
pisoFoam
python3 extract_peak.py
