cases/cfd/fluids/taylor_green_vortex_2d_re100/solution/case/system/setExprFieldsDict
/*--------------------------------*- C++ -*----------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setExprFieldsDict;
}

// Impose the exact Taylor-Green (1937) initial velocity field at t=0:
//   Ux = -cos(x)*sin(y)
//   Uy =  sin(x)*cos(y)
//   Uz =  0
// (the exp(-2*nu*t) decay factor is 1 at t=0). pisoFoam then evolves the
// transient field; at t=5 the peak |Ux| decays to exp(-2*0.01*5) ~ 0.904837.

expressions
(
    U
    {
        field       U;
        dimensions  [0 1 -1 0 0 0 0];
        constants
        {
        }
        variables
        (
        );
        expression
        #{
            vector
            (
                -cos(pos().x())*sin(pos().y()),
                 sin(pos().x())*cos(pos().y()),
                 0
            )
        #};
    }
);
